# Lodaing Data from CSV files

In [25]:
#import  pandas librart to read csv file 
import pandas as pd

In [26]:
#read the CSV file as a dataframe using pandas 
dataframe = pd.read_csv('D:/TimeSeries/Time Series Analysis and Forcasting usin Pyhton/Forecasting Resources (ST Academy)\Data + Code/daily-total-female-births-CA.csv', header =0)
#parsing date column as datetime
dataframe2 = pd.read_csv('D:/TimeSeries/Time Series Analysis and Forcasting usin Pyhton/Forecasting Resources (ST Academy)\Data + Code/daily-total-female-births-CA.csv', header =0,parse_dates=[0])

**First Five Records**

In [27]:
dataframe.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [28]:
dataframe.date.dtype

dtype('O')

In [29]:
dataframe2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [30]:
dataframe2.date.dtype

dtype('<M8[ns]')

**Date Parser**

In [32]:
dateparser = lambda x : pd.datetime.strptime(x,'%Y-%m-%d')
df_date = pd.read_csv('D:/TimeSeries/Time Series Analysis and Forcasting usin Pyhton/Forecasting Resources (ST Academy)\Data + Code/daily-total-female-births-CA.csv', header =0, parse_dates=[0],date_parser=dateparser)

<ipython-input-32-29684e421c2f>:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  dateparser = lambda x : pd.datetime.strptime(x,'%Y-%m-%d')

**Using date as Index**

In [34]:
series = pd.read_csv('D:/TimeSeries/Time Series Analysis and Forcasting usin Pyhton/Forecasting Resources (ST Academy)\Data + Code/daily-total-female-births-CA.csv', header =0, parse_dates=[0],index_col=0,squeeze=True)

In [35]:
series.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

# Exploring Time Series Data

## size

In [36]:
series.shape

(365,)

In [37]:
dataframe2.shape

(365, 2)

## Querying by Time

In [38]:
print(series['1959-01'])

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

In [39]:
dataframe2[(dataframe2.date > '1959-01-01')&(dataframe2.date < '1959-01-31')]

         date  births
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44
5  1959-01-06      29
6  1959-01-07      45
7  1959-01-08      43
8  1959-01-09      38
9  1959-01-10      27
10 1959-01-11      38
11 1959-01-12      33
12 1959-01-13      55
13 1959-01-14      47
14 1959-01-15      45
15 1959-01-16      37
16 1959-01-17      50
17 1959-01-18      43
18 1959-01-19      41
19 1959-01-20      52
20 1959-01-21      34
21 1959-01-22      53
22 1959-01-23      39
23 1959-01-24      32
24 1959-01-25      37
25 1959-01-26      43
26 1959-01-27      39
27 1959-01-28      35
28 1959-01-29      44
29 1959-01-30      38

## Describe Method

In [40]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64

In [41]:
dataframe2.describe()

           births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000